Repository: NeonCore-AU/NeonCore-Atlas
Catalog: apps/macos/NeonCoreMacApp/Localizable.xcstrings
Source language: en_au
Languages: zh_hans

# app.tagline
source: Open-source advanced network client
zh_hans: 开源高级网络客户端

# nav.dashboard
source: Dashboard
zh_hans: 仪表板

# nav.nodes
source: Nodes
zh_hans: 节点

# nav.profiles
source: Profiles
zh_hans: 配置

# nav.routing
source: Routing
zh_hans: 路由

# nav.logs
source: Logs
zh_hans: 日志

# nav.settings
source: Settings
zh_hans: 设置

# connection.status.disconnected
source: Disconnected
zh_hans: 已断开

# connection.action.connect
source: Connect
zh_hans: 连接

# connection.action.disconnect
source: Disconnect
zh_hans: 断开连接

# nodes.empty.title
source: No nodes
zh_hans: 没有节点

# nodes.empty.description
source: Import a subscription to load available nodes.
zh_hans: 导入订阅以加载可用节点。

# profiles.action.import_subscription
source: Import subscription
zh_hans: 导入订阅

# subscription.import.url_placeholder
source: Subscription URL
zh_hans: 订阅 URL

# settings.language
source: Language
zh_hans: 语言

# accessibility.connect_button
source: Connect or disconnect NeonCore
zh_hans: 连接或断开 NeonCore

# tooltip.connect_button
source: Toggle connection
zh_hans: 切换连接

# topbar.control_plane
source: Control Plane
zh_hans: 控制台

# nav.diagnostics
source: Diagnostics
zh_hans: 诊断

# dashboard.hero.title
source: NeonCore control plane
zh_hans: NeonCore 控制台

# dashboard.hero.subtitle
source: Import a subscription, test node reachability, start the local proxy engine, and manage system proxy state.
zh_hans: 导入订阅、测试节点连通性、启动本地代理引擎并管理系统代理状态。

# metric.nodes
source: Nodes
zh_hans: 节点

# metric.profiles
source: Profiles
zh_hans: 配置

# metric.latency
source: Latency
zh_hans: 延迟

# metric.traffic
source: Traffic
zh_hans: 流量

# metric.ready
source: Ready
zh_hans: 就绪

# metric.loaded
source: Loaded
zh_hans: 已加载

# metric.latest
source: Latest
zh_hans: 最新

# metric.session
source: Session
zh_hans: 会话

# empty.logs.description
source: Engine, subscription, and network events appear here.
zh_hans: 引擎、订阅和网络事件会显示在这里。

# topbar.status
source: Status
zh_hans: 状态

# routing.action.add_rule
source: Add rule
zh_hans: 添加规则

# dns.mode.system
source: System
zh_hans: 系统

# dns.mode.remote
source: Remote
zh_hans: 远程

# dns.mode.parallel
source: Parallel
zh_hans: 并行

# dns.prefer_ipv6
source: Prefer IPv6
zh_hans: 优先 IPv6

# settings.enabled
source: Enabled
zh_hans: 已启用

# settings.disabled
source: Disabled
zh_hans: 已停用

# diagnostics.action.run
source: Run diagnostics
zh_hans: 运行诊断

# diagnostics.daemon
source: Daemon
zh_hans: 守护进程

# diagnostics.profile
source: Profile checks
zh_hans: 配置检查

# diagnostics.latency
source: Latency run
zh_hans: 延迟测试

# settings.launch_at_login
source: Launch at login
zh_hans: 登录时启动

# settings.show_advanced
source: Show advanced controls
zh_hans: 显示高级控制

# settings.debug_logs
source: Debug logs
zh_hans: 调试日志

# log.app_ready
source: NeonCore app ready
zh_hans: NeonCore 应用已就绪

# log.disconnected
source: Disconnected from proxy engine
zh_hans: 已断开代理引擎

# log.connected
source: Proxy engine connected
zh_hans: 代理引擎已连接

# log.node_selected
source: Node selected and connected
zh_hans: 已选择并连接节点

# log.node_added
source: Manual node added
zh_hans: 已添加手动节点

# log.latency_completed
source: Latency test completed
zh_hans: 延迟测试已完成

# log.rule_added
source: Routing rule added
zh_hans: 已添加路由规则

# log.diagnostics_completed
source: Diagnostics completed
zh_hans: 诊断已完成

# metric.system_proxy
source: System proxy
zh_hans: 系统代理

# log.connect_failed
source: Could not start proxy engine
zh_hans: 无法启动代理引擎

# log.engine_available
source: Proxy engine available
zh_hans: 代理引擎可用

# log.engine_missing
source: Proxy engine is missing
zh_hans: 缺少代理引擎

# log.node_reachable
source: Active node is reachable
zh_hans: 当前节点可连接

# log.node_unreachable
source: Active node is unreachable
zh_hans: 当前节点不可连接

# routing.rules.empty.title
source: Engine-managed routing
zh_hans: 引擎管理的路由

# routing.rules.empty.description
source: Routing is generated from the selected node and DNS settings when the engine starts.
zh_hans: 启动引擎时会根据所选节点和 DNS 设置生成路由。

# log.protocol_adapter_missing
source: Selected node protocol is not supported by neoncore-kernel yet
zh_hans: neoncore-kernel 暂不支持所选节点协议

# log.engine_start_failed
source: neoncore-kernel could not start the local proxy listener
zh_hans: neoncore-kernel 无法启动本地代理监听

# log.proxy_preflight_failed
source: Proxy preflight failed before system proxy was enabled
zh_hans: 代理预检失败，尚未启用系统代理

# connection.status.connected
source: Connected
zh_hans: 已连接

# nodes.action.test_latency
source: Test latency
zh_hans: 测试延迟

# logs.title
source: Logs
zh_hans: 日志

# logs.action.clear
source: Clear
zh_hans: 清空

# subscription.import.success
source: Subscription imported
zh_hans: 订阅导入成功

# nodes.latency.unknown
source: Unknown
zh_hans: 未知
